<!-- terraform cdk action for options with hash afcc818abf2bffba4acdd11f298a817d -->
### ✅ Successfully applied Terraform CDK Stack 'cdktf'



<details><summary>Show Run</summary>

```shell
(node:2291) [DEP0040] DeprecationWarning: The `punycode` module is deprecated. Please use a userland alternative instead.
(Use `node --trace-deprecation ...` to show where the warning was created)
cdktf  Initializing HCP Terraform...
cdktf  Initializing provider plugins...
       - Finding cloudflare/cloudflare versions matching "5.0.0-alpha1"...
cdktf  - Installing cloudflare/cloudflare v5.0.0-alpha1...
cdktf  - Installed cloudflare/cloudflare v5.0.0-alpha1 (self-signed, key ID C76001609EE3B136)
       Partner and community providers are signed by their developers.
       If you'd like to know more about provider signing, you can read about it here:
       https://www.terraform.io/docs/cli/plugins/signing.html
       Terraform has created a lock file .terraform.lock.hcl to record the provider
       selections it made above. Include this file in your version control repository
       so that Terraform can guarantee to make the same selections by default when
       you run "terraform init" in the future.
cdktf  HCP Terraform has been successfully initialized!

       You may now begin working with HCP Terraform. Try running "terraform plan" to
       see any changes that are required for your infrastructure.

       If you ever set or change modules or Terraform Settings, run "terraform init"
       again to reinitialize your working directory.
cdktf  - Fetching cloudflare/cloudflare 5.0.0-alpha1 for linux_amd64...
cdktf  - Retrieved cloudflare/cloudflare 5.0.0-alpha1 for linux_amd64 (self-signed, key ID C76001609EE3B136)
       - Obtained cloudflare/cloudflare checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
cdktf  Success! Terraform has validated the lock file and found no need for changes.
cdktf  Running apply in HCP Terraform. Output will stream here. Pressing Ctrl-C
       will cancel the remote apply if it's still pending. If the apply started it
       will stop streaming the logs, but will not stop the apply running remotely.

       Preparing the remote apply...
cdktf  To view this run in a browser, visit:
       https://app.terraform.io/app/autolife-robotics/cdktf/runs/run-4jVaj53S5sHtFpPo
cdktf  Waiting for the plan to start...
cdktf  Terraform v1.10.5
       on linux_amd64
       Initializing plugins and modules...
cdktf  cloudflare_zone.autolife (autolife)-tech: Refreshing state... [id=e6cf32ebd792da633bbbb135019b46af]
       cloudflare_zone.autolife (autolife): Refreshing state... [id=0339d30aedd8613d8e05591cf97f6ada]
cdktf  cloudflare_zone.autolife (autolife)-ai: Refreshing state... [id=f0a700ad7840afdff8b3ea4cd4de5847]
       cloudflare_dns_record.www_autolife (www_autolife): Refreshing state... [id=deeda1c89731993128c961b0ffbf9bdb]
       cloudflare_dns_record.mainpage_autolife (mainpage_autolife): Refreshing state... [id=8c6af21688e32ae9f2469de37a8778e0]
       cloudflare_dns_record.netbird_autolife (netbird_autolife): Refreshing state... [id=4e04b29370cd71fe6f9c739b9ddf5a7d]
       cloudflare_dns_record.frp_dashboard_autolife (frp_dashboard_autolife): Refreshing state... [id=8799c2ff570271bdded5630f588da3fa]
       cloudflare_dns_record.mngt_autolife (mngt_autolife): Refreshing state... [id=1085a7462c305c5bd3e4827a043fc6b1]
       cloudflare_dns_record.rust-server_autolife (rust-server_autolife): Refreshing state... [id=a33f522f077f4626f7c3725149930d15]
       cloudflare_dns_record.vr_sg_autolife (vr_sg_autolife): Refreshing state... [id=a42929bbfc6b285ce5e4d93da155cb2b]
       cloudflare_dns_record.mail-www (mail-www): Refreshing state... [id=f3cea1ca8ba373c1359cfa9d740b520f]
       cloudflare_dns_record.freeman_cname (freeman_cname): Refreshing state... [id=cd5f69905985036d0ecd20b9ad6d8dae]
cdktf  Terraform used the selected providers to generate the following execution
       plan. Resource actions are indicated with the following symbols:
       -/+ destroy and then create replacement

       Terraform will perform the following actions:
cdktf  # cloudflare_dns_record.freeman_cname (freeman_cname) must be replaced
       -/+ resource "cloudflare_dns_record" "freeman_cname" {
             + comment_modified_on = (known after apply)
             ~ created_on          = "2025-01-26T13:33:27.183788Z" -> (known after apply)
             ~ id                  = "cd5f69905985036d0ecd20b9ad6d8dae" -> (known after apply)
             ~ meta                = jsonencode(
                   {
                     - auto_added             = false
                     - managed_by_apps        = false
                     - managed_by_argo_tunnel = false
                   }
               ) -> (known after apply)
             ~ modified_on         = "2025-01-26T13:33:27.183788Z" -> (known after apply)
               name                = "freeman"
             ~ proxiable           = true -> (known after apply)
             ~ settings            = jsonencode(
                   {
                     - flatten_cname = false
                   }
               ) -> (known after apply)
             ~ tags                = [] -> (known after apply)
             + tags_modified_on    = (known after apply)
             ~ zone_id             = "0339d30aedd8613d8e05591cf97f6ada" -> "e6cf32ebd792da633bbbb135019b46af" # forces replacement
               # (4 unchanged attributes hidden)
           }

       Plan: 1 to add, 0 to change, 1 to destroy.
cdktf
cdktf  cloudflare_dns_record.freeman_cname (freeman_cname): Destroying... [id=cd5f69905985036d0ecd20b9ad6d8dae]
       cloudflare_dns_record.freeman_cname (freeman_cname): Destruction complete after 1s
       cloudflare_dns_record.freeman_cname (freeman_cname): Creating...
cdktf  cloudflare_dns_record.freeman_cname (freeman_cname): Creation complete after 0s [id=7fa92b96a59c80cac2bc7ce7e53de14e]
cdktf  Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

No outputs found.

```

</details>